src/InformationRegisters/КодыМаркировкиДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыМаркировкиДляПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКриптохвост</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиМаркированнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Comment>Документ поступления</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтруктураИерархииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтруктураИерархииНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыОбменаСЧестнымЗнаком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыОбменаСЧестнымЗнаком</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезAPI</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыИдентификаторовТовараККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИдентификаторовТовараККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодТовараНеРаспознан</Name>
					<Comment>Код товара, который не распознан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN8</Name>
					<Comment>Код товара в формате EAN-8, UPC-E</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN13</Name>
					<Comment>Код товара в формате EAN-13, UPC-A</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеITF14</Name>
					<Comment>Код товара в формате ITF-14</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеDataMatrixGS1</Name>
					<Comment>Код товара в формате GS1 Data Matrix или Data Matrix маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзделияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС2</Name>
					<Comment>Код товара в кодировке ЕГАИС 2.0 в формате PDF417</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС3</Name>
					<Comment>Код товара в кодировке ЕГАИС 3.0 в формате Data Matrix</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/МаркировкаТоваровСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполнение начальных значений констант настроек обменов
//
Процедура ЗаполнитьНачальнуюНастройку() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущееЗначение = Константы.РежимОбменаСЧестнымЗнаком.Получить();
	
	// По умолчанию установим обмен по api
	Если ТекущееЗначение = Перечисления.СпособыОбменаСЧестнымЗнаком.ПустаяСсылка() Тогда
		Константы.РежимОбменаСЧестнымЗнаком.Установить(Перечисления.СпособыОбменаСЧестнымЗнаком.ЧерезAPI);
	КонецЕсли;
	
КонецПроцедуры

// Добавление служебных реквизитов настроек обмена
//
// Параметры:
//  Форма	- Форма				- Форма настроек обмена
//
Процедура ИнициализироватьСлужебныеРеквизиты(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СлужебныеРеквизиты = Новый Структура();
	Если НЕ ЕстьРеквизит(Форма, "РежимОбменаСЧестнымЗнаком") Тогда
		СлужебныеРеквизиты.Вставить("РежимОбменаСЧестнымЗнаком", Константы.РежимОбменаСЧестнымЗнаком.Получить());
	КонецЕсли;
	
	// Производим создание дополнительных реквизитов формы
	УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
	
КонецПроцедуры

// Процедура - Проверка кодов маркировки перед записью
//
// Параметры:
//  Объект				 - ДокументОбъект	 - Записываемый документ
//  ИмяТабличнойЧасти	 - Строка			 - Имя табличной части документа.
//
Процедура ПроверкаКодовМаркировкиПередЗаписью(Объект, ИмяТабличнойЧасти = "Товары") Экспорт
	
	// Проверим наличие ТЧ кодов маркировки.
	Если НЕ ЕстьРеквизит(Объект,, "КодыМаркировки") Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьПодтверждение = ЕстьРеквизит(Объект, "Подтверждено", "КодыМаркировки");
	
	// Удалим коды маркировки, которые не связаны с товарами
	МассивУдаления = Новый Массив;
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	Для Каждого ТекущаяСтрока Из Объект.КодыМаркировки Цикл
		
		Если ЕстьПодтверждение И ПустаяСтрока(ТекущаяСтрока.ИдентификаторТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
		НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			МассивУдаления.Добавить(ТекущаяСтрока);
		КонецЕсли;
		
		// Приведем коды маркировки к формату хранения без хвостов
		ТекущаяСтрока.КодМаркировки = 
			МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
				ТекущаяСтрока.КодМаркировки,,
				СтрНачинаетсяС(ТекущаяСтрока.КодМаркировки, "("));
		
	КонецЦикла;
	
	// Непосредственно удаление.
	Для Каждого СтрокаУдаления Из МассивУдаления Цикл
		Объект.КодыМаркировки.Удалить(СтрокаУдаления);
	КонецЦикла;
	
КонецПроцедуры // ПроверкаКодовМаркировкиПередЗаписью()

// Проверка заполнения у документа корректность ТЧ Коды маркировки
//
// Параметры:
//  Объект					 - ДокументОбъект - Документ с маркировкой товаров.
//  Отказ					 - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ИмяТаблицыТоваров		 - Строка - Имя таблицы товаров в документе.
//  ИмяТаблицыМаркировки	 - Строка - Имя таблицы кодов маркировки в документе.
//  ПроверкаОбязательности	 - Булево - Признак полной проверки или частичной (только соответствия количества кодов).
//
Процедура ПроверитьЗаполнениеКодовМаркировки(
		Объект,
		Отказ,
		ИмяТаблицыТоваров = "Товары",
		ИмяТаблицыМаркировки = "КодыМаркировки",
		ПроверкаОбязательности = Ложь) Экспорт
	
	// Проверка права для дальнейшего выполнения
	Если НЕ ПравоПользователя("ПроверкаЗаполненияСправочниковИДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, что нет признака восстановления последовательностей.
	ЭтоВосстановлениеПоследовательностей = ПолучитьЗначениеПараметраСтруктуры(
		Объект.ДополнительныеСвойства,
		"ЭтоВосстановлениеПоследовательностей",
		Ложь);
	Если ЭтоВосстановлениеПоследовательностей Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим соответствие количества кодов маркировок и количество товаров.
	ПроверитьКоличествоКодовМаркировкиИТоваров(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки);
	
	// Проверим уникальность кодов маркировки в документе
	ПроверитьУникальностьКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки);
	
	// Проверить корректность кодов маркировки
	ПроверитьКорректностьКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки);
	
	// Проверка в зависимости от настройки обязательности ввода
	РежимЗаписи = ПолучитьЗначениеПараметраСтруктуры(
		Объект.ДополнительныеСвойства,
		"РежимЗаписи",
		РежимЗаписиДокумента.Проведение);
	Если ПроверкаОбязательности И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьОбязательноеЗаполнениеКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеКодовМаркировки()

// Производим заполнение кодов маркировки на основании документов.
//
// Параметры:
//  Объект				 - ДокументОбъект - Документ, который вводится на основании
//  Основание			 - ДокументСсылка - Документ, на основании которого вводится документ
//  ИмяТаблицыМаркировки - ИмяТаблицыМаркировки - Имя табличной части документа с маркировкой
//
Процедура ЗаполнитьКодыМаркировкиТоваров(Объект, Основание, ИмяТаблицыМаркировки = "КодыМаркировки") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(Основание);
	
	ТекстЗапроса = "";
	
	Если ТипОснования = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		
		ИмяДокумента = Основание.Метаданные().Имя;
		ЕстьГТД = Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ГТД") <> Неопределено;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ДокументКодыМаркировки.КодМаркировки КАК КодМаркировки
		|ПОМЕСТИТЬ КодыМаркировок
		|ИЗ
		|	Документ." + ИмяДокумента + ".КодыМаркировки КАК ДокументКодыМаркировки
		|ГДЕ
		|	ДокументКодыМаркировки.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументТовары.ИдентификаторТовара КАК ИдентификаторТовара,
		|	" + ?(ЕстьГТД, "ДокументТовары.ГТД", "ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)") + " КАК ГТД
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	Документ." + ИмяДокумента + ".Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыМаркировок.КодМаркировки КАК КодМаркировки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ТаблицаТоваров.ГТД КАК ГТД
		|ИЗ
		|	КодыМаркировок КАК КодыМаркировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
		|		ПО КодыМаркировок.ИдентификаторТовара = ТаблицаТоваров.ИдентификаторТовара";
		
	Иначе
		// Для остальных объектов никаких действий выполнять не будем
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект[ИмяТаблицыМаркировки].Очистить();
	Исключение
		// ТЧ с кодами маркировки нет у документа
		Возврат;
	КонецПопытки;
	
	// Заполним доп. поля для товарной строки
	Для Каждого СтрокаТовар Из Объект.Товары Цикл
		Если ПустаяСтрока(СтрокаТовар.ИдентификаторТовара) Тогда
			СтрокаТовар.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстЗапроса = "" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основание", Основание);
	
	МаркировкаТоваров = Запрос.Выполнить().Выгрузить();
	
	МаркировкаТоваров.Сортировать("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
	
	// Поля поиска строки в ТЧ Товары
	СтруктураОтбораСГТД = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
	СтруктураОтбораБезГТД = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
	
	ЕстьГТД = ЕстьРеквизит(Объект, "ГТД", "Товары");
	
	// Занесем маркировку в ТЧ документа с привязкой к строкам
	Для Каждого ТекущаяСтрока Из МаркировкаТоваров Цикл
		
		// Найдем строки в ТЧ Товары документа
		Если ЕстьГТД И ЗначениеЗаполнено(ТекущаяСтрока.ГТД) Тогда
			ЗаполнитьЗначенияСвойств(СтруктураОтбораСГТД, ТекущаяСтрока);
			СтрокиТоваров = Объект.Товары.НайтиСтроки(СтруктураОтбораСГТД);
		Иначе
			// Не во всех документа есть ГТД
			СтрокиТоваров = Новый Массив;
		КонецЕсли;
		
		// Для данной маркировки нет строки в ТЧ Товары
		Если СтрокиТоваров.Количество() = 0 Тогда
			
			// Поищем стороки без ГТД
			ЗаполнитьЗначенияСвойств(СтруктураОтбораБезГТД, ТекущаяСтрока);
			СтрокиТоваров = Объект.Товары.НайтиСтроки(СтруктураОтбораБезГТД);
			
			Если СтрокиТоваров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИдентификаторТовара = "";
		Если ПустаяСтрока(СтрокиТоваров[0].ИдентификаторТовара) Тогда
			СтрокиТоваров[0].ИдентификаторТовара = Новый УникальныйИдентификатор;
			ИдентификаторТовара = СтрокиТоваров[0].ИдентификаторТовара;
		Иначе
			// Проверим что для строки товара еще не превышено количество маркировок
			// Для ситуации когда в ТЧ есть несколько строк с одинаковой номенклатуры
			Для Каждого СтрокаТоваров Из СтрокиТоваров Цикл
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("ИдентификаторТовара", СтрокаТоваров.ИдентификаторТовара);
				НайденныеКодыМаркировки = Объект[ИмяТаблицыМаркировки].НайтиСтроки(СтруктураПоиска);
				
				// Количество товара в строке меньше, чем маркировок - туда и добавим
				Если СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент > НайденныеКодыМаркировки.Количество() Тогда
					ИдентификаторТовара = СтрокаТоваров.ИдентификаторТовара;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		// Нашли строку товаров маркировки, добавляем маркировку
		Если НЕ ПустаяСтрока(ИдентификаторТовара) Тогда
			НоваяСтрока = Объект[ИмяТаблицыМаркировки].Добавить();
			НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
			НоваяСтрока.КодМаркировки = ТекущаяСтрока.КодМаркировки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКодыМаркировкиТоваров()

// Устанавливаем условное оформление для характеристик номенклатуры.
//
// Параметры:
//  Форма						 - Форма	 - Содержит данную форму. 
//  ИмяПоляКодаМаркировки		 - Строка	 - Наименование элемента формы, содержащего характеристики номенклатуры,
//												если оно отличается от "ТоварыХарактеристикаНоменклатуры".
//  ПутьКПолюОтбора				 - Строка	 - Наименование элемента формы, содержащего значение отбора.
//
Процедура УстановитьУсловноеОформлениеКодыМаркировок(Форма,
		ИмяПоляКодаМаркировки = "ТоварыКодыМаркировки",
		ПутьКПолюОтбора = "Объект.Товары.МаркируемыйТовар") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляКодаМаркировки].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не ведется>'"));
	
	Если ЕстьРеквизит(Форма, "ПроверкаСоответствияКодовМаркировкиПроводилась") Тогда
		//	 оформление соответствия кодов маркировки
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляКодаМаркировки].Имя);
		
		ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЕстьРазличияСостоянийКМ");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ЕстьРеквизит(Форма.Объект, "ПроверкаСоответствияКодовМаркировкиПроводилась", "Товары") Тогда
			ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПроверкаСоответствияКодовМаркировкиПроводилась");
		Иначе
			ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроверкаСоответствияКодовМаркировкиПроводилась");
		КонецЕсли;
		ОтборЭлемента.ЛевоеЗначение = ЛевоеЗначение;
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;

		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		ЭлементУсловногоОформления.Оформление
			.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.СписокКодовМаркировкиОшибкиПриПроверкеШрифт);
	КонецЕсли;
	
КонецПроцедуры // УстановитьУсловноеОформлениеКодыМаркировок()

// Проверка наличия у номенклатуры остатов на регистрих при установке признака обязательности маркировки.
//
// Параметры:
//  ТипНоменклатуры - СправочникСсылка.ТипыНоменклатуры - приверяемый тип номенклатуры.
//
// Возвращаемое значение:
//  Булево - Истина, если есть остаток, Ллжь - в противном случае.
//
Функция ПроверитьОстатокНоменклатуры(ТипНоменклатуры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	//               |	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	//               |ПОМЕСТИТЬ ТаблицаОстатоковВПроизводстве
	//               |ИЗ
	//               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, Номенклатура.ТипНоменклатуры = &ТипНоменклатуры) КАК ТоварыВПроизводствеОстатки
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ТоварыВПроизводствеОстатки.Номенклатура
	//               |
	//               |ИНДЕКСИРОВАТЬ ПО
	//               |	Номенклатура
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	МаркировкаТоваровВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	//               |	СУММА(МаркировкаТоваровВПроизводствеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	//               |ПОМЕСТИТЬ ТаблицаОстатковКодовМаркировки
	//               |ИЗ
	//               |	РегистрНакопления.МаркировкаТоваровВПроизводстве.Остатки(, Номенклатура.ТипНоменклатуры = &ТипНоменклатуры) КАК МаркировкаТоваровВПроизводствеОстатки
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	МаркировкаТоваровВПроизводствеОстатки.Номенклатура
	//               |
	//               |ИНДЕКСИРОВАТЬ ПО
	//               |	Номенклатура
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ТаблицаОстатковКодовМаркировки.Номенклатура КАК Номенклатура,
	//               |	ТаблицаОстатковКодовМаркировки.КоличествоОстаток КАК КоличествоОстатокаВПроизводстве,
	//               |	ТаблицаОстатоковВПроизводстве.КоличествоОстаток КАК КоличествоОстатокМаркировки
	//               |ИЗ
	//               |	ТаблицаОстатоковВПроизводстве КАК ТаблицаОстатоковВПроизводстве
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКодовМаркировки КАК ТаблицаОстатковКодовМаркировки
	//               |		ПО ТаблицаОстатоковВПроизводстве.Номенклатура = ТаблицаОстатковКодовМаркировки.Номенклатура
	//               |			И ТаблицаОстатоковВПроизводстве.КоличествоОстаток <> ТаблицаОстатковКодовМаркировки.КоличествоОстаток";
	//Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры.Ссылка);
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Количество() > 0 Тогда
	//	Возврат Истина;
	//КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьОстатокНоменклатуры()

// Делает запись в регистр "Коды маркировки для печати" кодов маркировки с криптохвостами.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказКодовМаркировки - документ заказа кодов маркировки;
//  КодыМаркировки - ТаблицаЗначений - таблица, содержащая информацию о кодах маркировки:
//    * Номенклатура - СправочникСсылка.Номенклатура - номенклатура;
//    * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикаНоменклатуры - характеристика номенклатуры;
//    * КодМаркировки - Строка - полученный полный код маркировки.
//
Процедура ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.КодыМаркировкиДляПечати.ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки);
	
КонецПроцедуры

// Поиск соответствия ГТИН из кода маркировки для номенклатуры и запись в регистр Штрихкодов
//
// Параметры:
//  Объект				 - ДокументСсылка - Документ, на основании которого проверяем
//  ИмяТаблицыТоваров	 - Строка - Имя табличной части документа с товарами
//  ИмяТаблицыМаркировки - Строка - Имя табличной части документа с кодами маркировки
//
Процедура ПроверитьИДобавитьГТИННоменклатуры(
		Объект,
		ИмяТаблицыТоваров = "Товары",
		ИмяТаблицыМаркировки = "КодыМаркировки") Экспорт
	
	// Проверим наличие настройки для выполнения операции
	//ДобавитьНовыйШтрихкодПриПоступленииТовара = ПолучитьЗначениеУчетнойПолитики(
	//	ПланыВидовХарактеристик.УчетныеПолитики.ДобавитьНовыйШтрихкодПриПоступленииТовара,,
	//	Объект.Дата);
	ДобавитьНовыйШтрихкодПриПоступленииТовара = Ложь;
	
	Если НЕ ДобавитьНовыйШтрихкодПриПоступленииТовара Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРеквизит(Объект,, ИмяТаблицыТоваров)
		ИЛИ НЕ ЕстьРеквизит(Объект,, ИмяТаблицыМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним таблицу номенклатурой и ГТИН
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКодов.Колонки.Добавить("ХарактеристикаНоменклатуры",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаКодов.Колонки.Добавить("ШтрихКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(13)));
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	СписокТЧДокумента = СтрШаблон("%1,%2", ИмяТаблицыТоваров, ИмяТаблицыМаркировки);
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, СписокТЧДокумента);
	ТаблицаТоваров = ДанныеДокумента[ИмяТаблицыТоваров].Выгрузить();
	ТаблицаКодовМаркировки = ДанныеДокумента[ИмяТаблицыМаркировки].Выгрузить();
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		// Найдем коды маркировки товара
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовара);
		НайденныеКодыМаркировки = ТаблицаКодовМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаМаркировки Из НайденныеКодыМаркировки Цикл
			
			// Разберем маркировку
			СтруктураМаркировки =
				МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(СтрокаМаркировки.КодМаркировки);
				
			// Это не маркировка
			Если СтруктураМаркировки.ТипИдентификатораТовара <>
				ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1") Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаКодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
			
			СтрокаGTIN = Формат(Число(СтруктураМаркировки.GTIN), "ЧГ=0");
			НоваяСтрока.ШтрихКод = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(СтрокаGTIN);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Найдем соответствие в регистре штрихкодов
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаШК.Номенклатура КАК Номенклатура,
	|	ТаблицаШК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаШК.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ТаблицаШК
	|ИЗ
	|	&ТаблицаШК КАК ТаблицаШК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШК.Номенклатура КАК Номенклатура,
	|	ТаблицаШК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаШК.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ТаблицаШК КАК ТаблицаШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ТаблицаШК.Номенклатура = Штрихкоды.Объект
	|			И ТаблицаШК.ШтрихКод = Штрихкоды.Штрихкод
	|ГДЕ
	|	Штрихкоды.Объект ЕСТЬ NULL ИЛИ 
	|	ЕСТЬNULL(Штрихкоды.GTIN, ИСТИНА) = ИСТИНА";
	Запрос.УстановитьПараметр("ТаблицаШК", ТаблицаКодов);
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
		НоваяЗапись.Штрихкод = Выборка.Штрихкод;
		НоваяЗапись.Объект = Выборка.Номенклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяЗапись.GTIN   = Истина;
		НоваяЗапись.Запрет = Ложь;
		НоваяЗапись.Записать();
	КонецЦикла;
	
КонецПроцедуры // ПроверитьИДобавитьГТИННоменклатуры()

// Записать результат проверки кодов маркировани из Честного знака
//
// Параметры:
//  Документ		 - ДокументОбъект	 - Документ, в котором была проверка.
//  ДатаПроверки	 - Дата				 - Дата, по которой проводилась проверка
//  АвторПроверки	 - СправочникСсылка.Пользователи	 - Инициатор проверки кодов маркировки.
//  Результат		 - Булево			 - Результат проверки.
//
Процедура ЗафиксироватьРезультатПроверкиКодовМаркировки(Документ, ДатаПроверки, АвторПроверки, Результат) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СостоянияПроверкиКодовМаркировки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ДатаПроверки;
	МенеджерЗаписи.Документ = Документ.Ссылка;
	МенеджерЗаписи.Пользователь = АвторПроверки;
	МенеджерЗаписи.Успешно = Результат;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры // ЗафиксироватьРезультатПроверкиКодовМаркировки()

// Обработчик обновления для зачискти Криптохвостов в существующих документах и регистрах
Процедура ОбновитьКодыМаркировкиСКриптохвостом() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьОшибки = Ложь;
	
	ДокументыСМаркировкой = ДокументыСКодамиМаркировки();
	
	Для Каждого ДокументСМаркировкой Из ДокументыСМаркировкой Цикл
		
		ЕстьОшибки = ОтрезатьКриптохвосты(ДокументСМаркировкой) ИЛИ ЕстьОшибки;
		
	КонецЦикла;
	
	ЕстьОшибки = РегистрыСведений.СостоянияКодовМаркировки.ОтрезатьКриптохвосты() ИЛИ ЕстьОшибки;
	//ЕстьОшибки = РегистрыНакопления.МаркировкаТоваровВПроизводстве.ОтрезатьКриптохвосты() ИЛИ ЕстьОшибки;
	
	Если ЕстьОшибки Тогда
		
		ВызватьИсключение
			НСтр("ru = 'При очистке криптохвостов кодов маркировки возникли ошибки. Подробнее см. Журнал регистрации'");
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Проверка наличия кодов маркировки в производстве по всей номенклатуре
//
// Параметры:
//  ЗаказНаряд	 - ДокументОбъект.ЗаказНаряд	 - Заказ-наряд, по которому выполняется проверка.
//  Отказ		 - Булево	 - Признак того, что проверка пройдена с ошибкой.
//
Процедура ПроверитьКодыМаркировкиВПроизводстве(ЗаказНаряд, Отказ) Экспорт
//	
//	// Проверку выполняем только в состоянии "Выполнен"
//	Если ЗаказНаряд.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Проверка права для дальнейшего выполнения
//	Если НЕ ПравоПользователя("ПроверкаЗаполненияСправочниковИДокументов") Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Проверим, что нет признака восстановления последовательностей.
//	ЭтоВосстановлениеПоследовательностей = ПолучитьЗначениеПараметраСтруктуры(
//		ЗаказНаряд.ДополнительныеСвойства,
//		"ЭтоВосстановлениеПоследовательностей",
//		Ложь);
//	Если ЭтоВосстановлениеПоследовательностей Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Проверка в зависимости от настройки обязательности ввода
//	РежимЗаписи = ПолучитьЗначениеПараметраСтруктуры(
//		ЗаказНаряд.ДополнительныеСвойства,
//		"РежимЗаписи",
//		РежимЗаписиДокумента.Проведение);
//	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекстШаблонаСообщения = 
//		НСтр("ru = 'Количество [%1] %2 с характеристикой %3 без кодов маркировок - %4. Необходимо указать коды маркировки'");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	               |	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
//	               |	ЗаказНарядТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	               |	ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент КАК Количество
//	               |ПОМЕСТИТЬ ТаблицаТоваров
//	               |ИЗ
//	               |	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
//	               |ГДЕ
//	               |	ЗаказНарядТовары.Ссылка = &ЗаказНаряд
//	               |	И ЗаказНарядТовары.Номенклатура.ТипНоменклатуры.МаркировкаОбязательная
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	Номенклатура,
//	               |	ХарактеристикаНоменклатуры
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	МаркировкаТоваровВПроизводствеОстатки.Номенклатура КАК Номенклатура,
//	               |	МаркировкаТоваровВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	               |	МаркировкаТоваровВПроизводствеОстатки.КоличествоОстаток КАК КоличествоОстаток
//	               |ПОМЕСТИТЬ ТоварыМаркировкиВПроизводстве
//	               |ИЗ
//	               |	РегистрНакопления.МаркировкаТоваровВПроизводстве.Остатки(
//	               |			,
//	               |			ЗаказНаряд = &ЗаказНаряд
//	               |				И (Номенклатура, ХарактеристикаНоменклатуры) В
//	               |					(ВЫБРАТЬ
//	               |						ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	               |						ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
//	               |					ИЗ
//	               |						ТаблицаТоваров КАК ТаблицаТоваров)) КАК МаркировкаТоваровВПроизводствеОстатки
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	Номенклатура,
//	               |	ХарактеристикаНоменклатуры
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	               |	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	               |	МАКСИМУМ(ТаблицаТоваров.Количество) КАК Количество,
//	               |	ТаблицаТоваров.Номенклатура.Артикул КАК НоменклатураАртикул,
//	               |	ПРЕДСТАВЛЕНИЕ(ТаблицаТоваров.Номенклатура) КАК НоменклатураПредставление,
//	               |	ПРЕДСТАВЛЕНИЕ(ТаблицаТоваров.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
//	               |	СУММА(ЕСТЬNULL(ТоварыМаркировкиВПроизводстве.КоличествоОстаток, 0)) КАК КоличествоВПроизводстве
//	               |ИЗ
//	               |	ТаблицаТоваров КАК ТаблицаТоваров
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМаркировкиВПроизводстве КАК ТоварыМаркировкиВПроизводстве
//	               |		ПО ТаблицаТоваров.Номенклатура = ТоварыМаркировкиВПроизводстве.Номенклатура
//	               |			И ТаблицаТоваров.ХарактеристикаНоменклатуры = ТоварыМаркировкиВПроизводстве.ХарактеристикаНоменклатуры
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ТаблицаТоваров.Номенклатура,
//	               |	ТаблицаТоваров.ХарактеристикаНоменклатуры,
//	               |	ТаблицаТоваров.Номенклатура.Артикул";
//	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд.Ссылка);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Если Выборка.Количество > Выборка.КоличествоВПроизводстве Тогда
//			
//			Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
//				ВывестиСообщение(
//					ТекстШаблонаСообщения,
//					ЗаказНаряд,,,
//					Отказ,
//					Выборка.НоменклатураАртикул,
//					Выборка.НоменклатураПредставление,
//					Выборка.ХарактеристикаНоменклатурыПредставление,
//					Выборка.Количество - Выборка.КоличествоВПроизводстве);
//			Иначе
//				ВывестиСообщение(
//					НСтр("ru = 'Количество [%1] %2 без кодов маркировок - %3. Необходимо указать коды маркировки.'"),
//					ЗаказНаряд,,,
//					Отказ,
//					Выборка.НоменклатураАртикул,
//					Выборка.НоменклатураПредставление,
//					Выборка.Количество - Выборка.КоличествоВПроизводстве);
//			КонецЕсли;
//			
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
КонецПроцедуры

// Получение доступного списка товарных групп
//
// Параметры:
//  УсловиеВыбора	 - Строка - Условие выбора товарных групп
// 
// Возвращаемое значение:
//  Массив - Список товарных групп
//
Функция ОсобенностиУчетаДляСозданияДокументов() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсобенностиУчетаНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОсобенностиУчетаНоменклатуры КАК ОсобенностиУчетаНоменклатуры
	|ГДЕ
	|	ОсобенностиУчетаНоменклатуры.ДоступноСозданиеДокументов
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Общий обработчик события настройки параметров выбора элементов управления диалога
//  в зависимости от значений реквизитов.
//
// Параметры:
//  Форма	 - УправляемаяФорма		 - Форма, в которой возникло событие.
//  Объект	 - ДанныеФормыСтруктура	 - Объект формы документа.
//
Процедура НастроитьПараметрыВыбораЭлементовФормы(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	//Если НЕ ЕстьРеквизит(Объект, "ТоварнаяГруппа") Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ТоварнаяГруппа = Объект.ТоварнаяГруппа;
	//
	//Если НЕ ЗначениеЗаполнено(ТоварнаяГруппа) Тогда
	//	УправлениеДиалогомСервер
	//	.УдалитьПараметрВыбора(Форма.Элементы.ТоварыНоменклатура.ПараметрыВыбора, "Отбор.ТипНоменклатуры");
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	//
	////Если ЕстьРеквизит(Объект, , "Товары")
	////	И (НЕ Форма.Элементы.Найти("ТоварыНоменклатура") = Неопределено) Тогда
	////	
	////	ТипыНоменклатуры = ТипыНоменклатурыТоварнойГруппы(ТоварнаяГруппа);
	////	
	////	Если ТипыНоменклатуры.Количество() > 0 Тогда
	////		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Форма.Элементы.ТоварыНоменклатура.ПараметрыВыбора, 
	////																"Отбор.ТипНоменклатуры", ТипыНоменклатуры);
	////	Иначе
	////		УправлениеДиалогомСервер
	////		.УдалитьПараметрВыбора(Форма.Элементы.ТоварыНоменклатура.ПараметрыВыбора, "Отбор.ТипНоменклатуры");
	////	КонецЕсли;
	////	
	////КонецЕсли;
	
КонецПроцедуры

// Проверка соответствия номенклатуры товарной группе документа.
//
// Параметры:
//  Объект	 - ДокументОбъект - Проверяемый документ.
//  Отказ	 - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//
Процедура НоменклатураСоответствуетОсобенностиУчета(Объект, Отказ) Экспорт
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Если НЕ ЕстьРеквизит(МетаданныеОбъекта, "ОсобенностьУчета") Тогда
		Возврат;
	КонецЕсли;
	
	ТоварныеТаблицы = Новый Массив;
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		Если ЕстьРеквизит(Объект, "Номенклатура", ТабличнаяЧасть.Имя) И Объект[ТабличнаяЧасть.Имя].Количество()>0 Тогда
			ТоварныеТаблицы.Добавить(ТабличнаяЧасть.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ТоварныеТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОсобенностьУчетаПредставление = Строка(Объект.ОсобенностьУчета);
	
	Для Каждого ИмяТаблицы Из ТоварныеТаблицы Цикл
		
		ТаблицаДляПроверки = ОсобенностьУчетаВТаблице(Объект[ИмяТаблицы], "Номенклатура");
		ПутьКНоменклатуре = СтрЗаменить("#Товары[#].Номенклатура", "#Товары", ИмяТаблицы);
		Для Каждого ТекущаяСтрока Из ТаблицаДляПроверки Цикл
			
			Если НЕ ТекущаяСтрока.ОсобенностьУчета = Объект.ОсобенностьУчета Тогда
				ВывестиСообщение(
				НСтр("ru = 'Особенность учета номенклатуры ""%1"" недопустима для особенности учета документа ""%2"".'"),
				Объект,
				ПутьКНоменклатуре, 
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.Номенклатура,
				ОсобенностьУчетаПредставление
			);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает тованрую группу из перечня номенклатуры.
//
// Параметры:
//  Номенклатура - Массив из СправочникСсылка.Номенклатура - номенклатура из табличной части.
//  УсловиеВыбора - Строка - условие отбора товарных групп в зависимости от документа.
//
// Возвращаемое значение:
//  СправочникСсылка.ТипыМаркировки - товарная группа.
//
Функция ОсобенностьУчетаНоменклатуры(Номенклатура) Экспорт
	
	Результат = Справочники.Номенклатура.ПолучитьОсобенностьУчета(Номенклатура);
	
	Возврат Результат;
	
КонецФункции

// Возвращает тованрую группу из перечня номенклатуры.
//
// Параметры:
//  Номенклатура - Массив из СправочникСсылка.Номенклатура - номенклатура из табличной части.
//  УсловиеВыбора - Строка - условие отбора товарных групп в зависимости от документа.
//
// Возвращаемое значение:
//  СправочникСсылка.ТипыМаркировки - товарная группа.
//
Функция ОсобенностьУчетаВТаблице(ИсходнаяТаблица, ИмяНоменклатуры = "Номенклатура") Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Номенклатура КАК Номенклатура,
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ
	|	ИсходнаяТаблица
	|ИЗ
	|	&ИсходнаяТаблица КАК ИсходнаяТаблица
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабНоменклатура.ТипНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчетаПоТипу,
	|	ТабНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ТабНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТабНоменклатура.Родитель КАК Родитель,
	|	ТабНоменклатура.Ссылка КАК Номенклатура,
	|	Представление(ТабНоменклатура.Ссылка) КАК НоменклатураПредставление,
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ
	|	ТабНоменклатура
	|ИЗ
	|	ИсходнаяТаблица КАК ИсходнаяТаблица
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК ТабНоменклатура
	|ПО
	|	ИсходнаяТаблица.Номенклатура = ТабНоменклатура.Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабНоменклатура.Родитель КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ГруппыТоваров
	|ИЗ
	|	ТабНоменклатура КАК ТабНоменклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыТоваров.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ГДЕ
	|	ГруппыТоваров.Номенклатура.ПометкаУдаления = Ложь И 
	|	(НЕ ГруппыТоваров.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	СтруктураИерархииНоменклатуры.Порядок КАК Приоритет
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ГруппыТоваров.Номенклатура = СтруктураИерархииНоменклатуры.Номенклатура
	|ГДЕ
	|	(НЕ СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаИерархии.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархииСрез
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархииСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаИерархии.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ
	|	ОсобенностиУчетаПоГруппам
	|ИЗ
	|	ТаблицаИерархииСрез КАК ТаблицаИерархииСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ПО
	|	ТаблицаИерархии.Номенклатура = ТаблицаИерархииСрез.Номенклатура И 
	|	ТаблицаИерархии.Приоритет = ТаблицаИерархииСрез.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	ТабНоменклатура.Номенклатура КАК Номенклатура,
	|	ТабНоменклатура.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ТабНоменклатура.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА НЕ ТабНоменклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			ТабНоменклатура.ОсобенностьУчета
	|		КОГДА (НЕ ОсобенностиУчетаПоГруппам.ОсобенностьУчета ЕСТЬ NULL) ТОГДА
	|			ОсобенностиУчетаПоГруппам.ОсобенностьУчета
	|		ИНАЧЕ
	|			ТабНоменклатура.ОсобенностьУчетаПоТипу
	|	КОНЕЦ КАК ОсобенностьУчета
	|ИЗ
	|	ТабНоменклатура КАК ТабНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ОсобенностиУчетаПоГруппам КАК ОсобенностиУчетаПоГруппам
	|ПО
	|	ТабНоменклатура.Родитель = ОсобенностиУчетаПоГруппам.Номенклатура
	|";
	
	ПутьКНоменклатуре = СтрЗаменить("ИсходнаяТаблица.#Номенклатура", "#Номенклатура", ИмяНоменклатуры);
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&Номенклатура", ПутьКНоменклатуре);
	Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очищает представления с кодами маркировки с криптохвостами после печати
//
Процедура ОчисткаНапечатанныхКодовМаркировки() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ОчисткаНапечатанныхКодовМаркировки);
	
	// Не указан срок хранения кодов
	СрокХранения = Константы.СрокХраненияКодовМаркировкиПечати.Получить();
	Если СрокХранения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КодыМаркировкиДляПечати.ДокументОснование КАК ДокументОснование,
	               |	КодыМаркировкиДляПечати.Номенклатура КАК Номенклатура,
	               |	КодыМаркировкиДляПечати.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КодыМаркировкиДляПечати.КодМаркировки КАК КодМаркировки
	               |ИЗ
	               |	РегистрСведений.КодыМаркировкиДляПечати КАК КодыМаркировкиДляПечати
	               |ГДЕ
	               |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КодыМаркировкиДляПечати.ДатаПечати, ДЕНЬ), &ТекущаяДата, ДЕНЬ) >= &СрокХранения
	               |	И КодыМаркировкиДляПечати.ДатаПечати <> ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СрокХранения", СрокХранения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Чистим код маркировки для всех найденных записей
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.КодыМаркировкиДляПечати.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		Набор.Отбор.ХарактеристикаНоменклатуры.Установить(Выборка.ХарактеристикаНоменклатуры);
		Набор.Отбор.КодМаркировки.Установить(Выборка.КодМаркировки);
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ОчисткаНапечатанныхКодовМаркировки()

Процедура ПроверитьКоличествоКодовМаркировкиИТоваров(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки)
	
	// Проверим, что нет строк, где количество товара меньше количества маркировки.
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыТоваров] Цикл
		
		// Найдем маркировку данной товарной строки
		СтруктураПоиска.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
		
		НайденныеСтроки = Объект[ИмяТаблицыМаркировки].НайтиСтроки(СтруктураПоиска);
		
		Если ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент < НайденныеСтроки.Количество() Тогда
			ВывестиСообщение(
				НСтр("ru = 'В строке %1 табличной части ""%2"" указано кодов маркировки больше, чем номенклатуры.'"),
				Объект,
				ИмяТаблицыТоваров + "[#].Номенклатура",
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.НомерСтроки,
				ИмяТаблицыТоваров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьКоличествоКодовМаркировкиИТоваров()

Процедура ПроверитьУникальностьКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки)
	
	// Проверим, чтоб не было повторяющихся кодов маркировок в документе
	ОбработанныеСтроки = Новый Соответствие;
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	СтруктураПоискаКода = Новый Структура("КодМаркировки");
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыМаркировки] Цикл
		
		Если ОбработанныеСтроки.Получить(ТекущаяСтрока.КодМаркировки) <> Неопределено Тогда
			// Разобран ранее
			Продолжить;
		КонецЕсли;
		
		ОбработанныеСтроки.Вставить(ТекущаяСтрока.КодМаркировки, ТекущаяСтрока.КодМаркировки);
		
		СтруктураПоискаКода.КодМаркировки = ТекущаяСтрока.КодМаркировки;
		НайденныеСтроки = Объект[ИмяТаблицыМаркировки].НайтиСтроки(СтруктураПоискаКода);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			
			// Найдено более одного кода маркировки
			НомераСтрокПовтора = Новый Массив;
			
			Для Каждого ТекущаяМаркирвока Из НайденныеСтроки Цикл
				СтруктураПоиска.ИдентификаторТовара = ТекущаяМаркирвока.ИдентификаторТовара;
				ТоварнаяСтрока = Объект[ИмяТаблицыТоваров].НайтиСтроки(СтруктураПоиска);
				Если ТоварнаяСтрока.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если НомераСтрокПовтора.Найти(Строка(ТоварнаяСтрока[0].НомерСтроки)) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НомераСтрокПовтора.Добавить(Строка(ТоварнаяСтрока[0].НомерСтроки));
			КонецЦикла;
			
			ВывестиСообщение(
				НСтр("ru = 'Для строк(и) %1 табличной части ""%2"" повторяется код маркировки %3'"),
				Объект,
				,
				,
				Отказ,
				СтрСоединить(НомераСтрокПовтора, ","),
				ИмяТаблицыТоваров,
				ТекущаяСтрока.КодМаркировки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки)
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	// Проверим, что все указанные коды маркировки соответствуют формату DataMatrix.
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыМаркировки] Цикл
		
		// Проверим, что считана именно маркировка.
		СтруктураШК = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяСтрока.КодМаркировки);
		
		Если (СтруктураШК.ТипИдентификатораТовара <>
			ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1")) Тогда
			
			СтруктураПоиска.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
			ТоварнаяСтрока = Объект[ИмяТаблицыТоваров].НайтиСтроки(СтруктураПоиска);
			
			ВывестиСообщение(
				НСтр("ru = 'В строке %1 табличной части ""%2"" некорректный код маркировки %3'"),
				Объект,
				ИмяТаблицыТоваров + "[#].Номенклатура",
				ТоварнаяСтрока[0].НомерСтроки,
				Отказ,
				ТоварнаяСтрока[0].НомерСтроки,
				ИмяТаблицыТоваров,
				ТекущаяСтрока.КодМаркировки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьОбязательноеЗаполнениеКодовМаркировки(Объект, Отказ, ИмяТаблицыТоваров, ИмяТаблицыМаркировки)
	
	// Сформируем список номенклатуры для проверки.
	СписокНоменклатуры = Новый Массив;
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыТоваров] Цикл
		Если ТипЗнч(ТекущаяСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") 
			И СписокНоменклатуры.Найти(ТекущаяСтрока.Номенклатура) = Неопределено Тогда
			СписокНоменклатуры.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	//// Получим настройки номенклатуры
	//СоответствиеНоменклатуры = Новый Соответствие;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК Ссылка,
	//|	Номенклатура.ТипНоменклатуры.МаркировкаОбязательная КАК МаркировкаОбязательная
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.Ссылка В (&МассивНоменклатуры)";
	//Запрос.УстановитьПараметр("МассивНоменклатуры", СписокНоменклатуры);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	СоответствиеНоменклатуры.Вставить(Выборка.Ссылка, Выборка.МаркировкаОбязательная);
	//КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыТоваров] Цикл
		
		//МаркировкаОбязательная = СоответствиеНоменклатуры.Получить(ТекущаяСтрока.Номенклатура);
		//
		//Если МаркировкаОбязательная = Неопределено ИЛИ НЕ МаркировкаОбязательная Тогда
		//	Продолжить;
		//КонецЕсли;
		
		// Проверим, что количество считанных кодов маркировки совпадает с количеством товаров.
		СтруктураПоиска.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
		
		НайденныеСтроки = Объект[ИмяТаблицыМаркировки].НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() < ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент Тогда
			ВывестиСообщение(
				НСтр("ru = 'Для строки %1 табличной части ""%2"" заполнено кодов маркировки меньше, чем указано номенклатуры.'"),
				Объект,
				ИмяТаблицыТоваров + "[#].Номенклатура",
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.НомерСтроки,
				ИмяТаблицыТоваров);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДокументыСКодамиМаркировки()
	
	Результат = Новый Массив;
	Результат.Добавить(Документы.ВводВОборотКодовМаркировки);
	//Результат.Добавить(Документы.ВводОстатковТоваровВПроизводстве);
	Результат.Добавить(Документы.ВозвратОтПокупателя);
	Результат.Добавить(Документы.ВозвратВОборотКодовМаркировки);
	Результат.Добавить(Документы.ВозвратПоставщику);
	Результат.Добавить(Документы.ВыводИзОборотаКодовМаркировки);
	Результат.Добавить(Документы.ЗакрытиеСмены);
	//Результат.Добавить(Документы.ИзвлечениеТоваровИзПроизводства);
	Результат.Добавить(Документы.КорректировкаПоступления);
	Результат.Добавить(Документы.КорректировкаРеализации);
	Результат.Добавить(Документы.ОтгрузкаТоваровКодовМаркировки);
	Результат.Добавить(Документы.Перемаркировка);
	//Результат.Добавить(Документы.ПеремещениеНезавершенногоПроизводства);
	//Результат.Добавить(Документы.ПеремещениеТоваровВПроизводство);
	Результат.Добавить(Документы.ПоступлениеТоваров);
	Результат.Добавить(Документы.РеализацияТоваров);
	Результат.Добавить(Документы.СписаниеКодовМаркировки);
	Результат.Добавить(Документы.СписаниеТоваров);
	Результат.Добавить(Документы.Чек);
	Результат.Добавить(Документы.ЧекНаОплату);
	
	Возврат Результат;
	
КонецФункции

Функция ОтрезатьКриптохвосты(МенеджерОбъекта)
	
	Выборка = МенеджерОбъекта.ДокументыСКодамиМаркировки();
	
	ЕстьОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		МенеджерОбъекта.ОтрезатьКриптохвосты(ДокументОбъект);
		
		Попытка
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
			
		Исключение
			
			ЕстьОшибки = Истина;
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Обновление ИБ.Очистка криптохвостов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти
